Repository: mozilla-l10n/mt-training-data
Catalog: ruc/ruc_pontoon.tmx
Source language: en_us
Languages: ruc

source: { $actionType } <micIcon></micIcon> and respond as naturally as you can
ruc: era oiremu kebokusobola

source: { $actionType } <playIcon></playIcon> and write down what you hear the person saying
ruc: era wandiika kyowuulire omuntu kyakubaza

source: { $actionType } <playIcon></playIcon> Listen to the audio clip, and check the transcription. Does it match? If not, edit it to match perfectly.
ruc: Wuliirya akatambi, wekenenye okuindula. Bikukwatagana? nikyaba bee, iramu otereeze leke bikwatagane

source: Add information
ruc: Yongeera amawuuro

source: An error occurred while creating this transcript
ruc: Wabairewo ensibi nga ekyandiko kini kikutondebwawo

source: An error occurred while editing the transcript
ruc: Wabaireewo ensobi nga ekiwandiko kikusunsulibwa

source: An error occurred while recording
ruc: Ensobi yaliwo nga okukwata amalobozi

source: An error occurred while skipping the transcript
ruc: Wabaireewo ensobi nga ekyandiko kigulukibwa.

source: An error occurred while skipping this prompt
ruc: Ensobi yaliwo nga okugiluka omulimu omubwangu

source: An error occurred while submitting the report
ruc: wabairewo ensobi nga nkusindika alipoota

source: An error occurred while uploading your response
ruc: Ensobi yaliwo nga okuwayo ebyakwiramu

source: An error occurred while voting the transcript
ruc: Wabaireewo ensobi nga okulonda ebindulibwe kukwaba omumaiso.

source: Are you already in our Beta testing group for Common Voice’s Spontaneous Speech Project?
ruc: Olimu omugurupu yaiswe eya Common Voice eyambazo zamangumangu?

source: A transcription should capture every word or non-lexical conversation sound that was said by the person, including repetitions.
ruc: Ekiwandiko kiyina okubamu buli kigambo ekyabazibwe omuntu amwei nebyo byeremu

source: Better support for language realities like translanguaging and <mark>code-switching</mark>
ruc: Kukuyambaku olulimi okuzwayo nke okuindula olulimi amwei nokuziwanyisa.

source: Better support for languages that have little or <mark>no text corpus</mark> to use (eg, sociolects, variants, historically unscripted languages etc)
ruc: Kikuyambaku endimi ezirina ebigambo oba ebyandiko ebidyoli ebyakolesya (nke embazo, okwawukanamu, endimi ezikansangwawo nga tiziwandike amwei nebindi )

source: By clicking “Send a link to my email”, you agree to our <termsLink>Terms of Service</termsLink> and <privacyLink>Privacy Policy</privacyLink> and that Mozilla may email you with information on how to participate in the Beta Testing for Common Voice’s Spontaneous Speech Project.
ruc: Aba Mozilla bakwiza kukusindikiira obukwenda okungeeri yakweyimbya oku gurupu ya Common Voice eya ntekateka ya mbazo zamangumangu eni.

source: By telling us about yourself, you will help developers build more inclusive technology
ruc: We okutukobera ebikukwataku, okwiza okuyambaku abatandiki okwomboka otekinologiya owaboona

source: Central Melanau
ruc: Akati wa Melanau

source: Change
ruc: kyusa

source: Check
ruc: Kebera

source: Check Transcriptions
ruc: kebera ebiwandiki

source: Click
ruc: Nnyiga

source: Click <guidanceLink>here</guidanceLink> to learn how to use this page
ruc: myiga ani oyege ekolesyamu ekibanja kini

source: Comment
ruc: endowooza

source: Common Voice is launching a second platform focused on collecting organic, spontaneous, unscripted speech. This will help lots of communities collect data more quickly, as well as being useful for data scientists and developers.
ruc: Common voice ekutongoza ekibanja kyakabiri nekirubirwa kyakumbanya ebyansagwawo, embazo zamangu ezitali ziwandike. Kini kikwakuyamba ebitundu ebyanjawulo okukumbanya amawuuro agakusingaku omubwangu, era nokuba agamugaso edi abanasayansi amwei nabatandiki.

source: Contact us
ruc: Tuikiire

source: Continue
ruc: weyongereyo

source: Continue speaking
ruc: Yaba omu maiso n'okubaza

source: Contribute
ruc: waayo

source: Contributing to dataset for { $language }
ruc: okuwayo amawuuro agakwata okululimi

source: <cookiesLink>Cookies<cookiesLink>
ruc: Obulango

source: Correct
ruc: Kituffu

source: Country/Region of Residence
ruc: Eianga/Ekikalanzira jobba

source: Delete
ruc: sangula

source: Different language
ruc: Olulimi Olwanjawulo

source: Done
ruc: Kiwaire

source: Don't wish to say
ruc: Takwegomba kubaza

source: Eastern Penan
ruc: Ebuwuluka Isanu bwa Penan

source: Edit
ruc: Sunsula

source: Email: <emailFragment>commonvoice@mozilla.com</emailFragment>
ruc: Akabokisi kabyampuliziganya

source: English
ruc: Luzungu

source: Enter your Country/Region of Residence
ruc: Teekamu Eianga lyaamu/ Ekikalanzira jooba

source: Enter your email
ruc: Ingiryamu akabokisi kamu akabyampuliziganya

source: Error
ruc: Nsobi

source: Error while playing audio file.
ruc: Ensobi eikireewo nga akatambi kakuzenya

source: Female/Feminine
ruc: Mukali/Mwaala

source: French
ruc: Lufalansa

source: Guidelines
ruc: Ndagiliro

source: How Spontaneous Speech works
ruc: Enkola ya mbazo ezamangumangu

source: I agree to Common Voice's <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
ruc: nkwikiriziganya namaloboozi gaamwe

source: Interested in getting involved with this project, or partnering with us?
ruc: Nkwendya okweyimbya omuntekateka eni, oba okukolagana naiswe.

source: Interface language:
ruc: Endimi ezikwesanisirya

source: Intersex
ruc: Ekikula kyamuntu

source: Just respond to the prompt as naturally as you can in a couple of sentences. Make sure your language is respectful and inoffensive.
ruc: Iramu ebyo byokura. kaka nti olulimi lwokukolesya lukuwa ekitiibwa ate nga telukuwemula

source: Kenyah
ruc: Munakenya

source: Learn how to check a transcription
ruc: yega okukebera ekiwandiko

source: Learn how to transcribe
ruc: yega engeri ya kuwandika

source: Learn how to use this page
ruc: Yega engeri yakukolesyamu ekibanja kini

source: Listen
ruc: wuliirya

source: Loading…
ruc: kusindika

source: Log In
ruc: weyunge

source: Log In / Sign Up
ruc: okweyunga/weyunge

source: Log Out
ruc: zwayo

source: Male/Masculine
ruc: Musaiza/Musigazi

source: <mark>Check</mark>
ruc: Kebeera

source: <mark>Data</mark>
ruc: Amawuuro

source: <mark>Prompt</mark>
ruc: Amangu-ago

source: <mark>Respond</mark>
ruc: Iramu

source: <mark>Transcribe</mark>
ruc: Indula

source: Michoacán Mazahua
ruc: Michoacan Mazahua

source: More languages coming soon
ruc: endimi ezindi zingi zikwiza

source: Non-binary
ruc: Ebintu ebitakwisanisiirya

source: Not Found
ruc: tekisangibwe

source: Offensive Content
ruc: Ebyabuseegu

source: Other
ruc: ekindi

source: Personally Identifiable Information
ruc: Amawuro agakusobola okufunibwa

source: <privacyLink>Privacy</privacyLink>
ruc: Ekyama

source: Record your response
ruc: wandika okwiramu kwamu

source: Report
ruc: Alipota

source: Report was passed successfully
ruc: Alipoota bajaakairye kusai

source: Respond
ruc: Iramu

source: Respond To Prompt
ruc: Iramu mubwangu

source: Response deleted successfully
ruc: Ebyakwiramu bisangulibweyo kusai

source: Response submitted successfully
ruc: Ebyakwiramu obiwereyo kusai

source: Select your age
ruc: Londaku emyaka jaamu

source: Select your sex or gender
ruc: Londaku ekikula kyaamu

source: Send a link to my email
ruc: Sindika omuwaatwa omukabokisi kange akabyampuliziganya.

source: Skip
ruc: Guluka

source: Skipped
ruc: Yagulukire

source: Something went wrong while fetching audio for transcriptions. Please try again later.
ruc: Wabaireewo ekizibu nga nkuswagana akatambi aka kuindula. Gezesyaku erai.

source: Something went wrong while fetching prompts. Please try again later.
ruc: waliwo ekyatambwire okubi nga nga okufuna amawulo. Gezaaku omulundi ogundi

source: Something went wrong while fetching transcriptions. Please try again later.
ruc: Wabaire ekizibu nga bakuswagana ebyaindulibwe. Gezesyaku erai.

source: Southwestern Tlaxiaco Mixtec
ruc: omumaserengata gabugwa isana ga Tlaxiaco Mixtec

source: Submit
ruc: Waayo

source: Submit All
ruc: waayo byona

source: Submit a report
ruc: waayo alipoota

source: Submitted
ruc: waayo

source: Success
ruc: Buwanguzi

source: Tap
ruc: kwataku

source: <termsLink>Terms</termsLink>
ruc: Embeera

source: Thank you for contributing to Spontaneous Speech!
ruc: webale okubanga olina kyowairyeeyo oku lubazo lwa mangumangu

source: Thank you for your information
ruc: Webale olwa mawuro gaamu

source: The content contains a language different than I was expecting.
ruc: Obukwenda buli omu Lulimu lwanjawulo okwolo lwenasubiranga

source: The content has disrespectful or offensive language.
ruc: Obukwenda bukutyobola oba bukuzuma

source: The MediaRecorder API is not supported in your browser.
ruc: Akakwata amaloboozi aka API tikakulosebwa ku kibanja kyamu

source: The page you are looking for could not be found
ruc: byokuswagana tebikusoboka kufunika

source: There are currently no prompts for this language. Please refresh the page or try again later.
ruc: olulimi luni teluliku omukasera kani. okusabibwa okwirya buyaaka ekibanja kini oba gezesyaku eirai

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
ruc: Ndowo kuindula kuluuwo okwakukebeera olulimi luni ati. Irya buyaka ekibanja kini oba gezesyaku eirai.

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
ruc: Ati ndowo katambi kakuindula lulimi luni. Irya buyaka ekibanja kini oba gezesyaku erai.

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ruc: Obukwenda buni bulimu amawuro agakukwata okubwomi bwamuntu nka Eibara, Akabokisi kabyampuliziganya, Ekifo, Enamba yamu, oba enamba ya simu

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
ruc: Amawuuro gani tigabuwaze okugawayo, gaweeyo nga weyendeirye. Nitulukya amaeuuro gani, tukyusa ebyo ebikukwataku, era nitubona nti ebintu nkamabara gamu, akabokisi kabyampuliziganya tibikwatagana nabikukwataku nke myaka oba ekikula kyamu. Amagezi gakikugu okukoora buli omwei, amawuuro agayambaku abatandiki okwomboka amagezi gakikugu galina okulanga abantu abanjawuulo. Yegga ebikusingaku lwaki metadata yetagisya.

source: Transcribe
ruc: kukoppolola

source: Transcribe Audio
ruc: Indula edobozi omubuwandike

source: Transcript edited successfully
ruc: Okuindula kusunsulibwe kusai

source: Transcript skipped successfully
ruc: Ekiwandiko kigulikibwe kusai

source: Transcript submitted successfully
ruc: Ekyandiko kiwebweiyo kusai

source: Transcript voted successfully
ruc: Okuindula kulondeerwe kusai

source: Transgender
ruc: Ekikula kyamuntu ekitakwisanisirya'ngana

source: Turkish
ruc: Mutuluki

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
ruc: Kyamugaso olwambaza ezikansangwawo era kolesya ensonga (nka, nga okwendya embazo zibonebwewo olwa kukola nabantu ababaza ebitali biwandike era ebibazibweeku.

source: Welcome to Spontaneous Speech
ruc: Webale okuiza oku lubazo lwamangumangu

source: We periodically release the dataset
ruc: Tulukya amawuuro gani omukiseera ekigere.

source: Western Penan
ruc: Gabugwa Isana bwa Penan

source: We will show you a prompt or question
ruc: Tukwiiza okukulanga ekyamangu oba ekibulyo.

source: What issues are you experiencing with this content?
ruc: Nsonga ki zosangire omu bukwenda buni

source: What is your age?
ruc: Olina emyaka imekai?

source: What is your sex or gender?
ruc: Oli wakikula ki?

source: Why are you asking?
ruc: Lwaki okubuulya?

source: Why we built this Spontaneous Speech prototype
ruc: Lwaki wombokerweewo akatiba ka'mbazo ezamangumangu.

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
ruc: wandika ebyo byenyini omuntu byeyabazire nga omulimu nebigambo nka "um" oba 'err'

source: Write down what you hear the person saying here
ruc: Wandiika kyowuliire omuntu nga akubaza ani

source: You check whether the transcription matches the audio
ruc: Kebeera oba ebindulibwe bikukwatagana nebiri omukatambi

source: You must allow microphone access.
ruc: oyina okwikiriza omuzindalo okwikibwaku

source: You respond or reply to it as naturally as you can
ruc: Oiramu okusigikira nkebwewatondeibwe.

source: You write down what you hear in the audio clips
ruc: Wandika ekyo kyokuura omukatambi.
